Revit 2024 API
BuiltInFailures.GenericMEPFailures.MaxWidthAndHeightReached Property
 Maximum width and height reached during sizing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MaxWidthAndHeightReached { get; }
Visual Basic
Public Shared ReadOnly Property MaxWidthAndHeightReached As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MaxWidthAndHeightReached {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace